[{"Short_Description":"Front Brake Service","Detail_Description":"PERFORMED FRONT BRAKE SERVICE, REPLACED FRONT BRAKE PADS AND ROTORS, CLEANED LUBE SHIMS, TEST DROVE OK"},{"Short_Description":"Rear Brake Service","Detail_Description":"PERFORMED REAR BRAKE SERVICE, REPLACED REAR BRAKE PADS AND ROTORS, CLEANED LUBE SHIMS, TEST DROVE OK"},{"Short_Description":"Mount and Balance-NEW-ONE TIRE","Detail_Description":"MOUNTED AND BALANCED ONE NEW TIRE, TORQUE WHEEL TO SPECIFICATION."},{"Short_Description":"Mount and Balance-NEW-TWO TIRES","Detail_Description":"MOUNTED AND BALANCED TWO NEW TIRES, TORQUE WHEEL TO SPECIFICATION."},{"Short_Description":"Mount and Balance-NEW-THREE TIRES","Detail_Description":"MOUNTED AND BALANCED THREE NEW TIRES, TORQUE WHEEL TO SPECIFICATION."},{"Short_Description":"Mount and Balance-NEW-FOUR TIRES","Detail_Description":"MOUNTED AND BALANCED FOUR NEW TIRES, TORQUE WHEEL TO SPECIFICATION."},{"Short_Description":"Mount and Balance-USED-ONE TIRE","Detail_Description":"MOUNTED AND BALANCED ONE USED TIRE, TORQUE WHEEL TO SPECIFICATION."},{"Short_Description":"Mount and Balance-USED-TWO TIRES","Detail_Description":"MOUNTED AND BALANCED TWO USED TIRES, TORQUE WHEELS TO SPECIFICATION."},{"Short_Description":"Mount and Balance-USED-THREE TIRES","Detail_Description":"MOUNTED AND BALANCED THREE USED TIRES, TORQUE WHEELS TO SPECIFICATION."},{"Short_Description":"Mount and Balance-USED-FOUR TIRES","Detail_Description":"MOUNTED AND BALANCED FOUR USED TIRES, TORQUE WHEELS TO SPECIFICATION."},{"Short_Description":"Oil Change","Detail_Description":"PERFORMED OIL AND FILTER SERVICE, PERFORMED MULTIPOINT INSPECTION, SET TIRE PRESSURE, TOP OFF FLUIDS, CHECKED LIGHTS"},{"Short_Description":"Transmission Service","Detail_Description":"PERFORMED TRANSMISSION FLUID SERVICE.  TEST DROVE VEHICLE OK"},{"Short_Description":"WASTE DISPOSAL","Detail_Description":"WASTE DISPOSAL FEE"},{"Short_Description":"SR-OIL CHANGE","Detail_Description":"PERFORM OIL AND FILTER SERVICE"},{"Short_Description":"RV","Detail_Description":"RAISED VEHICLE, VERIFIED CUSTOMER CONCERN"},{"Short_Description":"BATTERY","Detail_Description":"PERFORMED BATTERY LOAD TEST, PRINT OUT RESULTS FAILED.  PERFORMED ALTERNATOR OUT TEST PASSED, NECESSARY TO REPLACE BATTERY.  CLEANED BATTERY TERMINALS OK.  PERFORMED BATTERY LOAD TEST-PASSED"},{"Short_Description":"ROTATION","Detail_Description":"PERFORMED TIRE ROTATION, SET TIRE PRESSURE."},{"Short_Description":"ALTERNATOR","Detail_Description":"VERIFIED CONCERN, CHARGE BATTERY.   PERFORMED BATTERY LOAD TEST-PASSED. PERFORMED ALTERNATOR OUTPUT TEST-FAILED.  REMOVED ALTERNATOR BELT, REMOVED REPLACED ALTERNATOR ASSEMBLY.  SECURED IN PLACED.  TEST OPERATION OK"},{"Short_Description":"AIR FILTER","Detail_Description":"REMOVED AIR BOX FOUND AIR FILTER WORN AND DIRTY, REMOVED AND REPLACE AIR FILTER, SECURED IN PLACE"},{"Short_Description":"CABIN FILTER","Detail_Description":"REMOVED GLOVE BOX, INSPECTED CABIN AIR FILTER, FOUND FILTER WORN DIRTY, REMOVED AND REPLACED CABIN FILTER.  SECURED IN PLACE OK."},{"Short_Description":"AC","Detail_Description":"AC BLOWING WARM AIR, HOOKED UP AC MACHINE, RECOVERED, VACUUMED, AND CHARGED, ADDED DYE AND CHECKED FOR LEAKS.  NON FOUND AT THIS TIME, TEST OPERATION OK"},{"Short_Description":"Caliper","Detail_Description":"FOUND CALIPER BROKEN, REMOVED AND REPLACED CALIPER.  TEST DROVE VEHICLE OK"},{"Short_Description":"WHEEL ALIGNMENT","Detail_Description":"PERFORMED WHEEL ALIGNMENT ADJUSTED FRONT END PRINT BEFORE AFTER TEST DROVE OK."},{"Short_Description":"BRAKE FLUID FLUSH","Detail_Description":"PERFORMED BRAKE FLUID FLUSH AS PER MAINTENANCE, FLUSHED ALL BRAKE CALIPERS AND BRAKE CYLINDER.  TOP OFF BRAKE FLUID, TEST DROVE OK"},{"Short_Description":"WHEEL ALIGNMENT","Detail_Description":"PERFORMED WHEEL ALIGNMENT, PRINT BEFORE AND AFTER ADJUSTMENT.  TEST DROVE VEHICLE OK"},{"Short_Description":"STARTER","Detail_Description":"VEHICLE DOES NOT START.  VERIFIED CUSTOMER CONCERN FOUND STARTER INTERNALLY SHORTED.  REMOVED AND REPLACED STARTER, TEST OPERATION OK"},{"Short_Description":"SROIL CHANGE DESCRIPTION","Detail_Description":"PERFORM OIL AND FILTER SERVICE"},{"Short_Description":"WHEEL CYLINDERS","Detail_Description":"VERIFIED COMPLAINT FOUND WHEEL CYLINDERS BOTH WORN LEAKING.  RAISED VEHICLE REMOVED AND REPLACED BOTH WHEEL CYLINDERS, SECURED IN PLACE, BLEED BRAKES, RECHECKED FOR LEAKS NON FOUND, TEST DROVE OK"},{"Short_Description":"SPARK PLUGS","Detail_Description":"REPLACED SPARK PLUGS AS PER MAINTENANCE, REMOVED IGNITION COILS REMOVED REPLACED 8 SPARK PLUGS SECURED IN PLACED OK"},{"Short_Description":"AIR CONDITION","Detail_Description":"PERFORM A\/C SERVICE RECOVERED VACCUM RECHARGED A\/C SYSTEM ADDED DYE RECHECK FOR LEAKS OK."},{"Short_Description":"LIGHT BULB-BRAKE LIGHT","Detail_Description":"FOUND BRAKE LIGHT BULB NOT WORKING.  REMOVED AND REPLACED BRAKE LIGHT BULB OPEN FILAMENT. TEST OPERATION OK"},{"Short_Description":"LIGHT BULB-HEAD LIGHT","Detail_Description":"FOUND HEADLIGHT BULB NOT WORKING.  REMOVED AND REPLACED HEAD LIGHT BULB OPEN FILAMENT.  TEST OPERATION OK"},{"Short_Description":"PINPOINT","Detail_Description":"VERIFIED CUSTOMER CONCERN, RAISED VEHICLE, PERFORMED PINPOINT TEST"},{"Short_Description":"ENGINE LIGHT","Detail_Description":"CHECK ENGINE LIGHT ON DASH, HOOKED UP TESTER RETRIEVED CODE"},{"Short_Description":"CHECK ENGINE","Detail_Description":"CHECK ENGINE LIGHT ON DASH, VERIFIED CUSTOMER CONCERN, HOOKED UP COMPUTER TESTER, RETRIEVED CODE"},{"Short_Description":"PLUG TIRE","Detail_Description":"FOUND LEAK ON TIRE, REPAIRED FLAT TIRE, SET TIRE PRESSURE, TEST OPERATION OK"},{"Short_Description":"FLAT REPAIR","Detail_Description":"FOUND LEAK ON TIRE, REPAIRED FLAT TIRE, SET TIRE PRESSURE, TEST OPERATION OK"},{"Short_Description":"TRANSMISSION FLUID SERVICE","Detail_Description":"PERFORMED TRANSMISSION FLUID SERVICE RAISED VEHICLE DRAINED FLUID REMOVED PAN GASKET INSTALLED NEW FILTER SECURED IN PLACE ADDED FLUID TEST DROVE TOP OFF OK."},{"Short_Description":"TIRE ROTATION","Detail_Description":"PERFORMED TIRE ROTATION, SET TIRE PRESSURE, TORQUE WHEEL TO SPECS.  TEST DROVE OK"},{"Short_Description":"RADIATOR","Detail_Description":"RADIATOR LEAKING COOLANT.  RAISED VEHICLE, PERFORMED PINPOINT TEST FOUND RADIATOR WORN AND CRACKED.  REMOVED AND REPLACED RADIATOR.  TEST OPERATION OK"},{"Short_Description":"SERPENTINE BELT","Detail_Description":"FOUND SERPENTINE BELT WORN CRACKED.  REMOVED AND REPLACED SERPENTINE BELT.  TEST DROVE VEHICLE OK"},{"Short_Description":"BALANCING","Detail_Description":"PERFORMED WHEEL BALANCING, SET TIRE PRESSURE, TORQUE WHEEL TO SPEC"},{"Short_Description":"END LINK","Detail_Description":"FOUND SWAY BAR END LINK WORN AND LOOSE.  REMOVED AND REPLACED SWAY BAR END LINK, TEST OPERATION OK"},{"Short_Description":"SWAY BAR BUSHINGS","Detail_Description":"FOUND SWAY BAR BUSHINGS WORN AND LOOSE, REMOVED AND REPLACED SWAY BAR BUSHING.  TEST OPERATION"},{"Short_Description":"INSPECTION","Detail_Description":"PREP VEHICLE FOR STATE INSPECTION, CHECK FOR READINESS, OK"},{"Short_Description":"WINDOW REGULATOR","Detail_Description":"VERIFIED COSTUMER CONCERN PERFORM PINPOINT TEST FOUND WINDOW REGULATOR BROKEN. REMOVED AND REPLACED WINDOW REGULATOR TEST OPERATION OK"},{"Short_Description":null,"Detail_Description":null},{"Short_Description":null,"Detail_Description":null},{"Short_Description":"INTRO","Detail_Description":"VERIFIED CUSTOMER CONCERN, RAISED VEHICLE, PERFORMED PINPOINT TEST, FOUND"},{"Short_Description":"DRIVER SIDE AXLE","Detail_Description":"REPLACED DRIVER SIDE AXLE WORN CAUSING VEHICLE TO VIBRATE"},{"Short_Description":"PASSENGER SIDE AXLE","Detail_Description":"REPLCAED PASSENGER SIDE SXLE CAUSING VEHICLE TO SHAKE WHEN ACCELERATING"},{"Short_Description":"REAR HATCH SOCKS","Detail_Description":"REPLACED (BOTH) WORN REAR HATCH SOCKS SECURE INTO PLACE OK"},{"Short_Description":"CABIN AIR FILTER","Detail_Description":"REPLACED WORN DIRTY CABIN AIR FILTER AS PER MAINT"},{"Short_Description":"WIPER BLADES","Detail_Description":"REMOVED AND REPLACED WIPER BLADES, TEST OPERATION OK"},{"Short_Description":"SENSOR LIGHT ON","Detail_Description":"TIRE LIGHT ON DASH, VERIFIED CUSTOMER CONCERN FOUND VALVE STEM LEAKING.  REMOVED AND REPLACED TIRE PRESSURE SNSOR, PROGRAMMED TO VEHICLE, TEST OPERATION OK"},{"Short_Description":"TOWED TO SHOP","Detail_Description":"TOWED TO SHOP.  PERFORMED PINPOINT TEST FOUND FUEL PUMP BROKEN.  REMOVED AND REPLACED FUEL PUMP, TEST OPERATION OK"},{"Short_Description":"ABS LIGHT ON DASH","Detail_Description":"ABS LIGHT ON DASH.  HOOKED UP COMPUTER TESTER, RETRIEVED CODES:"},{"Short_Description":"WATER PUMP","Detail_Description":"VERIFIED CUSTOMER CONCERN.  PERFORMED PINPOINT TEST, FOUND WATER PUMP WORN LEAKING.  REMOVED AND REPLACED WATER PUMP, TEST OPERATION OK"},{"Short_Description":"CUSTOMER SUPPLY","Detail_Description":"INSTALLED CUSTOMER SUPPLY PARTS"},{"Short_Description":"PREP","Detail_Description":"PREP VEHICLE FOR STATE INSPECTION"},{"Short_Description":"THROTTLE BODY SERVICE","Detail_Description":"PERFORM THROTTLE BODY SERVICE, THROTTLE BODY WORN DIRTY.  TEST OPERATION OK"},{"Short_Description":"COOLANT FLUSH","Detail_Description":"PERFORM COOLANT FLUSH, TEST OPERATION OK"}]